Revit 2026 API

# ParameterAsDouble Method

---

Provides access to the double precision number within the parameter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double AsDouble()
```
```vb
Public Function AsDouble As Double
```
```cpp
public:
double AsDouble()
```
```fsharp
member AsDouble : unit -> float
```

#### Return Value

DoubleThe double value contained in the parameter.

The AsDouble method should only be used if the StorageType property returns that the internal contents of the parameter is a double.

#### Reference

Parameter Class

Autodesk.Revit.DB Namespace